stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u356xx.h
/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;            /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;            /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;            /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;          /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;          /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 uint32_t      RESERVED0[4];      /*!< Reserved, 0x94-0xA0                                                  */
 __IO uint32_t DLYCR;             /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 uint32_t      RESERVED1[1];      /*!< Reserved, 0xA8                                                       */
 __IO uint32_t DFLTIER;           /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;           /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 uint32_t      RESERVED2[1];      /*!< Reserved, 0xB4                                                       */
 __IO uint32_t SADCR;             /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;           /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;          /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;          /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t      RESERVED3[10];     /*!< Reserved, 0xC8-0xEC                                                  */
 __IO uint32_t DFLTDR;            /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

/**
  * @brief Operational Amplifier (OPAMP)
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register,                     Address offset: 0x00 */
  __IO uint32_t OTR;              /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
  __IO uint32_t LPOTR;            /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */
} OPAMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register, used for bits common to
                                    several OPAMP instances, Address offset: 0x00         */
} OPAMP_Common_TypeDef;

/**
  * @brief Power Control
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< Power control register 1,                          Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< Power control register 2,                          Address offset: 0x04 */
  __IO uint32_t CR3;              /*!< Power control register 3,                          Address offset: 0x08 */
  __IO uint32_t VOSR;             /*!< Power voltage scaling register,                    Address offset: 0x0C */
  __IO uint32_t SVMCR;            /*!< Power supply voltage monitoring control register,  Address offset: 0x10 */
  __IO uint32_t WUCR1;            /*!< Power wakeup control register 1,                   Address offset: 0x14 */
  __IO uint32_t WUCR2;            /*!< Power wakeup control register 2,                   Address offset: 0x18 */
  __IO uint32_t WUCR3;            /*!< Power wakeup control register 3,                   Address offset: 0x1C */
  uint32_t      RESERVED1;        /*!< Reserved,                                          Address offset: 0x20 */
  __IO uint32_t BDCR;             /*!< Power backup domain control register,              Address offset: 0x24 */
  __IO uint32_t DBPR;             /*!< Power disable backup domain register,              Address offset: 0x28 */
  uint32_t      RESERVED2;        /*!< Reserved,                                          Address offset: 0x2C */
  __IO uint32_t SECCFGR;          /*!< Power Security configuration register,             Address offset: 0x30 */
  __IO uint32_t PRIVCFGR;         /*!< Power privilege control register,                  Address offset: 0x34 */
  __IO uint32_t SR;               /*!< Power status register,                             Address offset: 0x38 */
  __IO uint32_t SVMSR;            /*!< Power supply voltage monitoring status register,   Address offset: 0x3C */
  uint32_t      RESERVED3;        /*!< Reserved,                                          Address offset: 0x20 */
  __IO uint32_t WUSR;             /*!< Power wakeup status register,                      Address offset: 0x44 */
  __IO uint32_t WUSCR;            /*!< Power wakeup status clear register,                Address offset: 0x48 */
  __IO uint32_t APCR;             /*!< Power apply pull configuration register,           Address offset: 0x4C */
  __IO uint32_t PUCRA;            /*!< Power Port A pull-up control register,             Address offset: 0x50 */
  __IO uint32_t PDCRA;            /*!< Power Port A pull-down control register,           Address offset: 0x54 */
  __IO uint32_t PUCRB;            /*!< Power Port B pull-up control register,             Address offset: 0x58 */
  __IO uint32_t PDCRB;            /*!< Power Port B pull-down control register,           Address offset: 0x5C */
  __IO uint32_t PUCRC;            /*!< Power Port C pull-up control register,             Address offset: 0x60 */
  __IO uint32_t PDCRC;            /*!< Power Port C pull-down control register,           Address offset: 0x64 */
  __IO uint32_t PUCRD;            /*!< Power Port D pull-up control register,             Address offset: 0x68 */
  __IO uint32_t PDCRD;            /*!< Power Port D pull-down control register,           Address offset: 0x6C */
  __IO uint32_t PUCRE;            /*!< Power Port E pull-up control register,             Address offset: 0x70 */
  __IO uint32_t PDCRE;            /*!< Power Port E pull-down control register,           Address offset: 0x74 */
  uint32_t      RESERVED4[2];     /*!< Reserved,                                          Address offset: 0x78 -> 0x7C */
  uint32_t      RESERVED5[2];     /*!< Reserved,                                          Address offset: 0x80 -> 0x84 */
  __IO uint32_t PUCRH;            /*!< Power Port H pull-up control register,             Address offset: 0x88 */
  __IO uint32_t PDCRH;            /*!< Power Port H pull-down control register,           Address offset: 0x8C */
  uint32_t      RESERVED6[8];     /*!< Reserved,                                          Address offset: 0x90 -> 0xAC */
  __IO uint32_t I3CPUCR1;         /*!< Power I3C pull-up control register 1,              Address offset: 0xB0 */
  __IO uint32_t I3CPUCR2;         /*!< Power I3C pull-up control register 2,              Address offset: 0xB4 */
} PWR_TypeDef;

/**
  * @brief SRAMs configuration controller
  */
typedef struct
{
  __IO uint32_t CR;           /*!< Control Register,                  Address offset: 0x00 */
  __IO uint32_t IER;          /*!< Interrupt enable register,         Address offset: 0x04 */
  __IO uint32_t ISR;          /*!< Interrupt status register,         Address offset: 0x08 */
  uint32_t      RESERVED0;    /*!< Reserved,                          Address offset: 0x0C */
  __IO uint32_t PEAR;         /*!< Parity error address register,     Address offset: 0x10 */
  __IO uint32_t ICR;          /*!< Interrupt clear register,          Address offset: 0x14 */
  __IO uint32_t WPR1;         /*!< Write protection register 1,       Address offset: 0x18 */
  __IO uint32_t WPR2;         /*!< Write protection register 2,       Address offset: 0x1C */
  uint32_t      RESERVED1;    /*!< Reserved,                          Address offset: 0x20 */
  __IO uint32_t PARKEYR;      /*!< Parity key register,               Address offset: 0x24 */
  __IO uint32_t ERKEYR;       /*!< Erase key register,                Address offset: 0x28 */
}RAMCFG_TypeDef;

/**
  * @brief Reset and Clock Control
  */
typedef struct
{
  __IO uint32_t CR;               /*!< RCC Clock Control Register                               Address offset: 0x000 */
  uint32_t      RESERVED0;        /*!< Reserved                                                 Address offset: 0x004 */
  __IO uint32_t ICSCR1;           /*!< RCC Internal Clock Sources Calibration Register 1        Address offset: 0x008 */
  __IO uint32_t ICSCR2;           /*!< RCC Internal Clock Sources Calibration Register 2        Address offset: 0x00C */
  __IO uint32_t ICSCR3;           /*!< RCC Internal Clock Sources Calibration Register 3        Address offset: 0x010 */
  __IO uint32_t CRRCR;            /*!< RCC Clock Recovery RC Register                           Address offset: 0x014 */
  uint32_t      RESERVED1;        /*!< Reserved                                                 Address offset: 0x018 */
  __IO uint32_t CFGR1;            /*!< RCC Clock Configuration Register 1                       Address offset: 0x01C */
  __IO uint32_t CFGR2;            /*!< RCC Clock Configuration Register 2                       Address offset: 0x020 */
  __IO uint32_t CFGR3;            /*!< RCC Clock Configuration Register 3                       Address offset: 0x024 */
  __IO uint32_t CFGR4;            /*!< RCC Clock Configuration Register 4                       Address offset: 0x028 */
  uint32_t      RESERVED2[9];     /*!< Reserved                                                 Address offset: 0x02C */
  __IO uint32_t CIER;             /*!< Clock Interrupt Enable Register                          Address offset: 0x050 */
  __IO uint32_t CIFR;             /*!< Clock Interrupt Flag Register                            Address offset: 0x054 */
  __IO uint32_t CICR;             /*!< Clock Interrupt Clear Register                           Address offset: 0x058 */
  uint32_t      RESERVED3;        /*!< Reserved                                                 Address offset: 0x05C */
  __IO uint32_t AHB1RSTR1;        /*!< AHB1 Peripherals Reset Register 1                        Address offset: 0x060 */
  __IO uint32_t AHB2RSTR1;        /*!< AHB2 Peripherals Reset Register 1                        Address offset: 0x064 */
  __IO uint32_t AHB2RSTR2;        /*!< AHB2 Peripherals Reset Register 2                        Address offset: 0x068 */
  uint32_t      RESERVED4[2];     /*!< Reserved                                                 Address offset: 0x06C */
  __IO uint32_t APB1RSTR1;        /*!< APB1 Peripherals Reset Register 1                        Address offset: 0x074 */
  __IO uint32_t APB1RSTR2;        /*!< APB1 Peripherals Reset Register 2                        Address offset: 0x078 */
  __IO uint32_t APB2RSTR;         /*!< APB2 Peripherals Reset Register                          Address offset: 0x07C */
  __IO uint32_t APB3RSTR;         /*!< APB3 Peripherals Reset Register                          Address offset: 0x080 */
  uint32_t      RESERVED5;        /*!< Reserved                                                 Address offset: 0x084 */
  __IO uint32_t AHB1ENR1;         /*!< AHB1 Peripherals Clock Enable Register 1                 Address offset: 0x088 */
  __IO uint32_t AHB2ENR1;         /*!< AHB2 Peripherals Clock Enable Register 1                 Address offset: 0x08C */
  __IO uint32_t AHB2ENR2;         /*!< AHB2 Peripherals Clock Enable Register 2                 Address offset: 0x090 */
  __IO uint32_t AHB1ENR2;         /*!< AHB1 Peripherals Clock Enable Register 2                 Address offset: 0x094 */
  uint32_t      RESERVED6;        /*!< Reserved                                                 Address offset: 0x098 */
  __IO uint32_t APB1ENR1;         /*!< APB1 Peripherals Clock Enable Register 1                 Address offset: 0x09C */
  __IO uint32_t APB1ENR2;         /*!< APB1 Peripherals Clock Enable Register 2                 Address offset: 0x0A0 */
  __IO uint32_t APB2ENR;          /*!< APB2 Peripherals Clock Enable Register                   Address offset: 0x0A4 */
  __IO uint32_t APB3ENR;          /*!< APB3 Peripherals Clock Enable Register                   Address offset: 0x0A8 */
  uint32_t      RESERVED7;        /*!< Reserved                                                 Address offset: 0x0AC */
  __IO uint32_t AHB1SLPENR1;      /*!< AHB1 Peripherals Clock Enable in Sleep Mode Register 1   Address offset: 0x0B0 */
  __IO uint32_t AHB2SLPENR1;      /*!< AHB2 Peripherals Clock Enable in Sleep Mode Register 1   Address offset: 0x0B4 */
  __IO uint32_t AHB2SLPENR2;      /*!< AHB2 Peripherals Clock Enable in Sleep Mode Register 2   Address offset: 0x0B8 */
  __IO uint32_t AHB1SLPENR2;      /*!< AHB1 Peripherals Clock Enable in Sleep Mode Register 2   Address offset: 0x0BC */
  uint32_t      RESERVED8;        /*!< Reserved                                                 Address offset: 0x0C0 */
  __IO uint32_t APB1SLPENR1;      /*!< APB1 Peripherals Clock Enable in Sleep Mode Register 1   Address offset: 0x0C4 */
  __IO uint32_t APB1SLPENR2;      /*!< APB1 Peripherals Clock Enable in Sleep Mode Register 2   Address offset: 0x0C8 */
  __IO uint32_t APB2SLPENR;       /*!< APB2 Peripherals Clock Enable in Sleep Mode Register     Address offset: 0x0CC */
  __IO uint32_t APB3SLPENR;       /*!< APB3 Peripherals Clock Enable in Sleep Mode Register     Address offset: 0x0D0 */
  uint32_t      RESERVED9;        /*!< Reserved                                                 Address offset: 0x0D4 */
  __IO uint32_t AHB1STPENR1;      /*!< AHB1 Peripherals Clock Enable in Stop Mode Register 1    Address offset: 0x0D8 */
  __IO uint32_t AHB2STPENR1;      /*!< AHB2 Peripherals Clock Enable in Stop Mode Register 1    Address offset: 0x0DC */
  uint32_t      RESERVED10[3];    /*!< Reserved                                                 Address offset: 0x0E0 */
  __IO uint32_t APB1STPENR1;      /*!< APB1 Peripherals Clock Enable in Stop Mode Register 1    Address offset: 0x0EC */
  __IO uint32_t APB1STPENR2;      /*!< APB1 Peripherals Clock Enable in Stop Mode Register 2    Address offset: 0x0F0 */
  __IO uint32_t APB2STPENR;       /*!< APB2 Peripherals Clock Enable in Stop Mode Register      Address offset: 0x0F4 */
  __IO uint32_t APB3STPENR;       /*!< APB3 Peripherals Clock Enable in Stop Mode Register      Address offset: 0x0F8 */
       uint32_t RESERVED11;       /*!< Reserved                                                 Address offset: 0x0FC */
  __IO uint32_t CCIPR1;           /*!< Peripherals Independent Clocks Configuration Register 1  Address offset: 0x100 */
  __IO uint32_t CCIPR2;           /*!< Peripherals Independent Clocks Configuration Register 2  Address offset: 0x104 */
  __IO uint32_t CCIPR3;           /*!< Peripherals Independent Clocks Configuration Register 3  Address offset: 0x108 */
  uint32_t      RESERVED12;       /*!< Reserved                                                 Address offset: 0x10C */
  __IO uint32_t BDCR;             /*!< Backup Domain Control Register                           Address offset: 0x110 */
  __IO uint32_t CSR;              /*!< Control & Status Register                                Address offset: 0x114 */
  uint32_t      RESERVED13[6];    /*!< Reserved                                                 Address offset: 0x118 */
  __IO uint32_t SECCFGR;          /*!< RCC Secure Configuration Register                        Address offset: 0x130 */
  __IO uint32_t PRIVCFGR;         /*!< RCC Privilege Configuration Register                     Address offset: 0x134 */
} RCC_TypeDef;

/**
  * @brief RNG
  */
typedef struct
{
  __IO uint32_t CR;               /*!< RNG control register,                     Address offset: 0x00 */
  __IO uint32_t SR;               /*!< RNG status register,                      Address offset: 0x04 */
  __IO uint32_t DR;               /*!< RNG data register,                        Address offset: 0x08 */
  __IO uint32_t NSCR;             /*!< RNG noise source control register,        Address offset: 0x0C */
  __IO uint32_t HTCR;             /*!< RNG health test configuration register,   Address offset: 0x10 */
} RNG_TypeDef;

/**
  * @brief Real-Time Clock
  */
typedef struct
{
  __IO uint32_t TR;               /*!< RTC time register,                              Address offset: 0x00 */
  __IO uint32_t DR;               /*!< RTC date register,                              Address offset: 0x04 */
  __IO uint32_t SSR;              /*!< RTC sub second register,                        Address offset: 0x08 */
  __IO uint32_t ICSR;             /*!< RTC initialization control and status register, Address offset: 0x0C */
  __IO uint32_t PRER;             /*!< RTC prescaler register,                         Address offset: 0x10 */
  __IO uint32_t WUTR;             /*!< RTC wakeup timer register,                      Address offset: 0x14 */
  __IO uint32_t CR;               /*!< RTC control register,                           Address offset: 0x18 */
  __IO uint32_t PRIVCFGR;         /*!< RTC privilege mode control register,            Address offset: 0x1C */
  __IO uint32_t SECCFGR;          /*!< RTC secure mode control register,               Address offset: 0x20 */
  __IO uint32_t WPR;              /*!< RTC write protection register,                  Address offset: 0x24 */
  __IO uint32_t CALR;             /*!< RTC calibration register,                       Address offset: 0x28 */
  __IO uint32_t SHIFTR;           /*!< RTC shift control register,                     Address offset: 0x2C */
  __IO uint32_t TSTR;             /*!< RTC time stamp time register,                   Address offset: 0x30 */
  __IO uint32_t TSDR;             /*!< RTC time stamp date register,                   Address offset: 0x34 */
  __IO uint32_t TSSSR;            /*!< RTC time-stamp sub second register,             Address offset: 0x38 */
       uint32_t RESERVED0;        /*!< Reserved,                                       Address offset: 0x3C */
  __IO uint32_t ALRMAR;           /*!< RTC alarm A register,                           Address offset: 0x40 */
  __IO uint32_t ALRMASSR;         /*!< RTC alarm A sub second register,                Address offset: 0x44 */
  __IO uint32_t ALRMBR;           /*!< RTC alarm B register,                           Address offset: 0x48 */
  __IO uint32_t ALRMBSSR;         /*!< RTC alarm B sub second register,                Address offset: 0x4C */
  __IO uint32_t SR;               /*!< RTC Status register,                            Address offset: 0x50 */
  __IO uint32_t MISR;             /*!< RTC masked interrupt status register,           Address offset: 0x54 */
  __IO uint32_t SMISR;            /*!< RTC secure masked interrupt status register,    Address offset: 0x58 */
  __IO uint32_t SCR;              /*!< RTC status Clear register,                      Address offset: 0x5C */
       uint32_t RESERVED1;        /*!< Reserved,                                       Address offset: 0x60 */
  __IO uint32_t TAMPTSCR;         /*!< RTC timestamp on tamper control register,       Address offset: 0x64 */
  __IO uint32_t TSIDR;            /*!< RTC timestamp status register,                  Address offset: 0x68 */
       uint32_t RESERVED2;        /*!< Reserved,                                       Address offset: 0x6C */
  __IO uint32_t ALRABINR;         /*!< RTC alarm A binary mode register,               Address offset: 0x70 */
  __IO uint32_t ALRBBINR;         /*!< RTC alarm B binary mode register,               Address offset: 0x74 */
} RTC_TypeDef;

/**
  * @brief Serial Audio Interface
  */
typedef struct
{
  uint32_t      RESERVED[17];     /*!< Reserved,                         Address offset: 0x00 to 0x40 */
  __IO uint32_t PDMCR;            /*!< SAI PDM control register,                 Address offset: 0x44 */
  __IO uint32_t PDMDLY;           /*!< SAI PDM delay register,                   Address offset: 0x48 */
} SAI_TypeDef;

typedef struct
{
  __IO uint32_t CR1;              /*!< SAI block x configuration register 1,     Address offset: 0x04 */
  __IO uint32_t CR2;              /*!< SAI block x configuration register 2,     Address offset: 0x08 */
  __IO uint32_t FRCR;             /*!< SAI block x frame configuration register, Address offset: 0x0C */
  __IO uint32_t SLOTR;            /*!< SAI block x slot register,                Address offset: 0x10 */
  __IO uint32_t IMR;              /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
  __IO uint32_t SR;               /*!< SAI block x status register,              Address offset: 0x18 */
  __IO uint32_t CLRFR;            /*!< SAI block x clear flag register,          Address offset: 0x1C */
  __IO uint32_t DR;               /*!< SAI block x data register,                Address offset: 0x20 */
} SAI_Block_TypeDef;

/**
  * @brief Secure digital input/output Interface
  */
typedef struct
{
  __IO uint32_t POWER;            /*!< SDMMC power control register,                Address offset: 0x00 */
  __IO uint32_t CLKCR;            /*!< SDMMC clock control register,                Address offset: 0x04 */
  __IO uint32_t ARG;              /*!< SDMMC argument register,                     Address offset: 0x08 */
  __IO uint32_t CMD;              /*!< SDMMC command register,                      Address offset: 0x0C */
  __I uint32_t  RESPCMD;          /*!< SDMMC command response register,             Address offset: 0x10 */
  __I uint32_t  RESP1;            /*!< SDMMC response 1 register,                   Address offset: 0x14 */
  __I uint32_t  RESP2;            /*!< SDMMC response 2 register,                   Address offset: 0x18 */
  __I uint32_t  RESP3;            /*!< SDMMC response 3 register,                   Address offset: 0x1C */
  __I uint32_t  RESP4;            /*!< SDMMC response 4 register,                   Address offset: 0x20 */
  __IO uint32_t DTIMER;           /*!< SDMMC data timer register,                   Address offset: 0x24 */
  __IO uint32_t DLEN;             /*!< SDMMC data length register,                  Address offset: 0x28 */
  __IO uint32_t DCTRL;            /*!< SDMMC data control register,                 Address offset: 0x2C */
  __I uint32_t  DCOUNT;           /*!< SDMMC data counter register,                 Address offset: 0x30 */
  __I uint32_t  STA;              /*!< SDMMC status register,                       Address offset: 0x34 */
  __IO uint32_t ICR;              /*!< SDMMC interrupt clear register,              Address offset: 0x38 */
  __IO uint32_t MASK;             /*!< SDMMC mask register,                         Address offset: 0x3C */
  __IO uint32_t ACKTIME;          /*!< SDMMC Acknowledgement timer register,        Address offset: 0x40 */
  uint32_t      RESERVED0[3];     /*!< Reserved, 0x44 - 0x4C - 0x4C                                      */
  __IO uint32_t IDMACTRL;         /*!< SDMMC DMA control register,                  Address offset: 0x50 */
  __IO uint32_t IDMABSIZE;        /*!< SDMMC DMA buffer size register,              Address offset: 0x54 */
  __IO uint32_t IDMABASER;        /*!< SDMMC DMA buffer base address register,      Address offset: 0x58 */
  uint32_t      RESERVED1[2];     /*!< Reserved, 0x60                                                    */
  __IO uint32_t IDMALAR;          /*!< SDMMC DMA linked list address register,      Address offset: 0x64 */
  __IO uint32_t IDMABAR;          /*!< SDMMC DMA linked list memory base register,  Address offset: 0x68 */
  uint32_t      RESERVED2[5];     /*!< Reserved, 0x6C-0x7C                                               */
  __IO uint32_t FIFO;             /*!< SDMMC data FIFO register,                    Address offset: 0x80 */
} SDMMC_TypeDef;

