stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u356xx.h
/*!< AHB1 Non secure peripherals */
#define GPDMA1_BASE_NS                  (AHB1PERIPH_BASE_NS)
#define GPDMA1_Channel0_BASE_NS         (GPDMA1_BASE_NS + 0x00000050UL)
#define GPDMA1_Channel1_BASE_NS         (GPDMA1_BASE_NS + 0x000000D0UL)
#define GPDMA1_Channel2_BASE_NS         (GPDMA1_BASE_NS + 0x00000150UL)
#define GPDMA1_Channel3_BASE_NS         (GPDMA1_BASE_NS + 0x000001D0UL)
#define GPDMA1_Channel4_BASE_NS         (GPDMA1_BASE_NS + 0x00000250UL)
#define GPDMA1_Channel5_BASE_NS         (GPDMA1_BASE_NS + 0x000002D0UL)
#define GPDMA1_Channel6_BASE_NS         (GPDMA1_BASE_NS + 0x00000350UL)
#define GPDMA1_Channel7_BASE_NS         (GPDMA1_BASE_NS + 0x000003D0UL)
#define GPDMA1_Channel8_BASE_NS         (GPDMA1_BASE_NS + 0x00000450UL)
#define GPDMA1_Channel9_BASE_NS         (GPDMA1_BASE_NS + 0x000004D0UL)
#define GPDMA1_Channel10_BASE_NS        (GPDMA1_BASE_NS + 0x00000550UL)
#define GPDMA1_Channel11_BASE_NS        (GPDMA1_BASE_NS + 0x000005D0UL)
#define FLASH_R_BASE_NS                 (AHB1PERIPH_BASE_NS + 0x00002000UL)
#define CRC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00003000UL)
#define TSC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00004000UL)
#define RAMCFG_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x00006000UL)
#define RAMCFG_SRAM1_BASE_NS            (RAMCFG_BASE_NS)
#define RAMCFG_SRAM2_BASE_NS            (RAMCFG_BASE_NS + 0x00000040UL)
#define ICACHE_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x00010400UL)
#define PWR_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00010800UL)
#define RCC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00010C00UL)
#define EXTI_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x00012000UL)
#define GTZC_TZSC1_BASE_NS              (AHB1PERIPH_BASE_NS + 0x00012400UL)
#define GTZC_MPCBB1_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00012C00UL)
#define GTZC_MPCBB2_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00013000UL)

/*!< APB3 Non secure peripherals */
#define SYSCFG_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00000400UL)
#define LPUART1_BASE_NS                 (APB3PERIPH_BASE_NS + 0x00002400UL)
#define I2C3_BASE_NS                    (APB3PERIPH_BASE_NS + 0x00002800UL)
#define LPTIM1_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004400UL)
#define LPTIM3_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004800UL)
#define LPTIM4_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004C00UL)
#define COMP1_BASE_NS                   (APB3PERIPH_BASE_NS + 0x00005400UL)
#define COMP2_BASE_NS                   (COMP1_BASE_NS + 0x00000004UL)
#define LCD_BASE_NS                      (APB3PERIPH_BASE_NS + 0x00008000UL)

/*!< AHB2 Non secure peripherals */
#define GPIOA_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000000UL)
#define GPIOB_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000400UL)
#define GPIOC_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000800UL)
#define GPIOD_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000C00UL)
#define GPIOE_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001000UL)
#define GPIOG_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001800UL)
#define GPIOH_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001C00UL)
#define ADC1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008000UL)
#define ADC2_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008100UL)
#define ADC12_COMMON_BASE_NS            (AHB2PERIPH_BASE_NS + 0x00008300UL)
#define DAC1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008400UL)
#define HASH_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x000A0400UL)
#define HASH_DIGEST_BASE_NS             (AHB2PERIPH_BASE_NS + 0x000A0710UL)
#define RNG_BASE_NS                     (AHB2PERIPH_BASE_NS + 0x000A0800UL)
#define DLYB_OCTOSPI1_BASE_NS           (AHB2PERIPH_BASE_NS + 0x000AF000UL)
#define OCTOSPI1_R_BASE_NS              (AHB2PERIPH_BASE_NS + 0x000B1400UL)

#if defined(CPU_IN_SECURE_STATE)
/*!< Flash, Peripheral and internal SRAMs base addresses - secure */
#define FLASH_BASE_S                    0x0C000000UL  /*!< FLASH secure base address        */
#define SYSTEM_FLASH_BASE_S             0x0FF80000UL  /*!< System FLASH secure base address */
#define SRAM1_BASE_S                    0x30000000UL  /*!< SRAM1 secure base address        */
#define SRAM2_BASE_S                    0x30030000UL  /*!< SRAM2 secure base address        */
#define PERIPH_BASE_S                   0x50000000UL  /*!< Peripheral secure base address   */

/*!< Peripheral memory map - secure */
#define APB1PERIPH_BASE_S               PERIPH_BASE_S
#define APB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x00010000UL)
#define AHB1PERIPH_BASE_S               (PERIPH_BASE_S + 0x00020000UL)
#define APB3PERIPH_BASE_S               (PERIPH_BASE_S + 0x00040000UL)
#define AHB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x02020000UL)

/*!< APB1 secure peripherals */
#define TIM2_BASE_S                     (APB1PERIPH_BASE_S + 0x00000000UL)
#define TIM3_BASE_S                     (APB1PERIPH_BASE_S + 0x00000400UL)
#define TIM4_BASE_S                     (APB1PERIPH_BASE_S + 0x00000800UL)
#define TIM6_BASE_S                     (APB1PERIPH_BASE_S + 0x00001000UL)
#define TIM7_BASE_S                     (APB1PERIPH_BASE_S + 0x00001400UL)
#define SPI3_BASE_S                     (APB1PERIPH_BASE_S + 0x00002000UL)
#define WWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x00002C00UL)
#define IWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x00003000UL)
#define SPI2_BASE_S                     (APB1PERIPH_BASE_S + 0x00003800UL)
#define USART3_BASE_S                   (APB1PERIPH_BASE_S + 0x00004800UL)
#define UART4_BASE_S                    (APB1PERIPH_BASE_S + 0x00004C00UL)
#define UART5_BASE_S                    (APB1PERIPH_BASE_S + 0x00005000UL)
#define I2C1_BASE_S                     (APB1PERIPH_BASE_S + 0x00005400UL)
#define I3C1_BASE_S                     (APB1PERIPH_BASE_S + 0x00005C00UL)
#define CRS_BASE_S                      (APB1PERIPH_BASE_S + 0x00006000UL)
#define OPAMP1_BASE_S                   (APB1PERIPH_BASE_S + 0x00007000UL)
#define OPAMP2_BASE_S                   (OPAMP1_BASE_S + 0x0000010UL)
#define VREFBUF_BASE_S                  (APB1PERIPH_BASE_S + 0x00007400UL)
#define RTC_BASE_S                      (APB1PERIPH_BASE_S + 0x00007800UL)
#define TAMP_BASE_S                     (APB1PERIPH_BASE_S + 0x00007C00UL)
#define LPTIM2_BASE_S                   (APB1PERIPH_BASE_S + 0x00009400UL)

/*!< APB2 secure peripherals */
#define TIM1_BASE_S                     (APB2PERIPH_BASE_S + 0x00002C00UL)
#define SPI1_BASE_S                     (APB2PERIPH_BASE_S + 0x00003000UL)
#define USART1_BASE_S                   (APB2PERIPH_BASE_S + 0x00003800UL)
#define TIM15_BASE_S                    (APB2PERIPH_BASE_S + 0x00004000UL)
#define TIM16_BASE_S                    (APB2PERIPH_BASE_S + 0x00004400UL)
#define TIM17_BASE_S                    (APB2PERIPH_BASE_S + 0x00004800UL)
#define USB_DRD_BASE_S                  (APB2PERIPH_BASE_S + 0x00006000UL)
#define USB_DRD_PMAADDR_S               (APB2PERIPH_BASE_S + 0x00006400UL)

/*!< AHB1 secure peripherals */
#define GPDMA1_BASE_S                   (AHB1PERIPH_BASE_S)
#define GPDMA1_Channel0_BASE_S          (GPDMA1_BASE_S + 0x00000050UL)
#define GPDMA1_Channel1_BASE_S          (GPDMA1_BASE_S + 0x000000D0UL)
#define GPDMA1_Channel2_BASE_S          (GPDMA1_BASE_S + 0x00000150UL)
#define GPDMA1_Channel3_BASE_S          (GPDMA1_BASE_S + 0x000001D0UL)
#define GPDMA1_Channel4_BASE_S          (GPDMA1_BASE_S + 0x00000250UL)
#define GPDMA1_Channel5_BASE_S          (GPDMA1_BASE_S + 0x000002D0UL)
#define GPDMA1_Channel6_BASE_S          (GPDMA1_BASE_S + 0x00000350UL)
#define GPDMA1_Channel7_BASE_S          (GPDMA1_BASE_S + 0x000003D0UL)
#define GPDMA1_Channel8_BASE_S          (GPDMA1_BASE_S + 0x00000450UL)
#define GPDMA1_Channel9_BASE_S          (GPDMA1_BASE_S + 0x000004D0UL)
#define GPDMA1_Channel10_BASE_S         (GPDMA1_BASE_S + 0x00000550UL)
#define GPDMA1_Channel11_BASE_S         (GPDMA1_BASE_S + 0x000005D0UL)
#define FLASH_R_BASE_S                  (AHB1PERIPH_BASE_S + 0x00002000UL)
#define CRC_BASE_S                      (AHB1PERIPH_BASE_S + 0x00003000UL)
#define TSC_BASE_S                      (AHB1PERIPH_BASE_S + 0x00004000UL)
#define RAMCFG_BASE_S                   (AHB1PERIPH_BASE_S + 0x00006000UL)
#define RAMCFG_SRAM1_BASE_S             (RAMCFG_BASE_S)
#define RAMCFG_SRAM2_BASE_S             (RAMCFG_BASE_S + 0x00000040UL)
#define ICACHE_BASE_S                   (AHB1PERIPH_BASE_S + 0x00010400UL)
#define PWR_BASE_S                      (AHB1PERIPH_BASE_S + 0x00010800UL)
#define RCC_BASE_S                      (AHB1PERIPH_BASE_S + 0x00010C00UL)
#define EXTI_BASE_S                     (AHB1PERIPH_BASE_S + 0x00012000UL)
#define GTZC_TZSC1_BASE_S               (AHB1PERIPH_BASE_S + 0x00012400UL)
#define GTZC_TZIC1_BASE_S               (AHB1PERIPH_BASE_S + 0x00012800UL)
#define GTZC_MPCBB1_BASE_S              (AHB1PERIPH_BASE_S + 0x00012C00UL)
#define GTZC_MPCBB2_BASE_S              (AHB1PERIPH_BASE_S + 0x00013000UL)

/*!< APB3 secure peripherals */
#define SYSCFG_BASE_S                   (APB3PERIPH_BASE_S + 0x00000400UL)
#define LPUART1_BASE_S                  (APB3PERIPH_BASE_S + 0x00002400UL)
#define I2C3_BASE_S                     (APB3PERIPH_BASE_S + 0x00002800UL)
#define LPTIM1_BASE_S                   (APB3PERIPH_BASE_S + 0x00004400UL)
#define LPTIM3_BASE_S                   (APB3PERIPH_BASE_S + 0x00004800UL)
#define LPTIM4_BASE_S                   (APB3PERIPH_BASE_S + 0x00004C00UL)
#define COMP1_BASE_S                    (APB3PERIPH_BASE_S + 0x00005400UL)
#define COMP2_BASE_S                    (COMP1_BASE_S + 0x00000004UL)
#define LCD_BASE_S                      (APB3PERIPH_BASE_S + 0x00008000UL)

/*!< AHB2 secure peripherals */
#define GPIOA_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000000UL)
#define GPIOB_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000400UL)
#define GPIOC_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000800UL)
#define GPIOD_BASE_S                    (AHB2PERIPH_BASE_S + 0x00000C00UL)
#define GPIOE_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001000UL)
#define GPIOG_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001800UL)
#define GPIOH_BASE_S                    (AHB2PERIPH_BASE_S + 0x00001C00UL)
#define ADC1_BASE_S                     (AHB2PERIPH_BASE_S + 0x00008000UL)
#define ADC2_BASE_S                     (AHB2PERIPH_BASE_S + 0x00008100UL)
#define ADC12_COMMON_BASE_S             (AHB2PERIPH_BASE_S + 0x00008300UL)
#define DAC1_BASE_S                     (AHB2PERIPH_BASE_S + 0x00008400UL)
#define HASH_BASE_S                     (AHB2PERIPH_BASE_S + 0x000A0400UL)
#define HASH_DIGEST_BASE_S              (AHB2PERIPH_BASE_S + 0x000A0710UL)
#define RNG_BASE_S                      (AHB2PERIPH_BASE_S + 0x000A0800UL)
#define DLYB_OCTOSPI1_BASE_S            (AHB2PERIPH_BASE_S + 0x000AF000UL)
#define OCTOSPI1_R_BASE_S               (AHB2PERIPH_BASE_S + 0x000B1400UL)
#endif /* CPU_IN_SECURE_STATE */

/*!< External memories base addresses - Not aliased */
#define OCTOSPI1_BASE                   EXTRAM_BASE_NS

/*!< DBGMCU base addresses - Not aliased */
#define DBGMCU_BASE                     (EPPB_BASE + 0x00004000UL)

/*!< USB PMA SIZE */
#define USB_DRD_PMA_SIZE        (2048U)         /*!< USB PMA Size 2Kbyte */

#if defined (CPU_IN_SECURE_STATE)
/*!< Root Secure Service Library */
/************ RSSLIB SAU system Flash region definition constants *************/
#define RSSLIB_SYS_FLASH_NS_PFUNC_START 0x0BF99040UL
#define RSSLIB_SYS_FLASH_NS_PFUNC_END   0x0BF990FFUL

