stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u356xx.h
/*******************  Bit definition for FLASH_SECBB2R2 register  ******************/
#define FLASH_SECBB2R2_SEC0_Pos                   (0U)
#define FLASH_SECBB2R2_SEC0_Msk                   (0x1UL << FLASH_SECBB2R2_SEC0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R2_SEC0                       FLASH_SECBB2R2_SEC0_Msk                       /*!< Page 32 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC1_Pos                   (1U)
#define FLASH_SECBB2R2_SEC1_Msk                   (0x1UL << FLASH_SECBB2R2_SEC1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R2_SEC1                       FLASH_SECBB2R2_SEC1_Msk                       /*!< Page 33 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC2_Pos                   (2U)
#define FLASH_SECBB2R2_SEC2_Msk                   (0x1UL << FLASH_SECBB2R2_SEC2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R2_SEC2                       FLASH_SECBB2R2_SEC2_Msk                       /*!< Page 34 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC3_Pos                   (3U)
#define FLASH_SECBB2R2_SEC3_Msk                   (0x1UL << FLASH_SECBB2R2_SEC3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R2_SEC3                       FLASH_SECBB2R2_SEC3_Msk                       /*!< Page 35 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC4_Pos                   (4U)
#define FLASH_SECBB2R2_SEC4_Msk                   (0x1UL << FLASH_SECBB2R2_SEC4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R2_SEC4                       FLASH_SECBB2R2_SEC4_Msk                       /*!< Page 36 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC5_Pos                   (5U)
#define FLASH_SECBB2R2_SEC5_Msk                   (0x1UL << FLASH_SECBB2R2_SEC5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R2_SEC5                       FLASH_SECBB2R2_SEC5_Msk                       /*!< Page 37 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC6_Pos                   (6U)
#define FLASH_SECBB2R2_SEC6_Msk                   (0x1UL << FLASH_SECBB2R2_SEC6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R2_SEC6                       FLASH_SECBB2R2_SEC6_Msk                       /*!< Page 38 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC7_Pos                   (7U)
#define FLASH_SECBB2R2_SEC7_Msk                   (0x1UL << FLASH_SECBB2R2_SEC7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R2_SEC7                       FLASH_SECBB2R2_SEC7_Msk                       /*!< Page 39 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC8_Pos                   (8U)
#define FLASH_SECBB2R2_SEC8_Msk                   (0x1UL << FLASH_SECBB2R2_SEC8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R2_SEC8                       FLASH_SECBB2R2_SEC8_Msk                       /*!< Page 40 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC9_Pos                   (9U)
#define FLASH_SECBB2R2_SEC9_Msk                   (0x1UL << FLASH_SECBB2R2_SEC9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R2_SEC9                       FLASH_SECBB2R2_SEC9_Msk                       /*!< Page 41 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC10_Pos                  (10U)
#define FLASH_SECBB2R2_SEC10_Msk                  (0x1UL << FLASH_SECBB2R2_SEC10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R2_SEC10                      FLASH_SECBB2R2_SEC10_Msk                      /*!< Page 42 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC11_Pos                  (11U)
#define FLASH_SECBB2R2_SEC11_Msk                  (0x1UL << FLASH_SECBB2R2_SEC11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R2_SEC11                      FLASH_SECBB2R2_SEC11_Msk                      /*!< Page 43 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC12_Pos                  (12U)
#define FLASH_SECBB2R2_SEC12_Msk                  (0x1UL << FLASH_SECBB2R2_SEC12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R2_SEC12                      FLASH_SECBB2R2_SEC12_Msk                      /*!< Page 44 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC13_Pos                  (13U)
#define FLASH_SECBB2R2_SEC13_Msk                  (0x1UL << FLASH_SECBB2R2_SEC13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R2_SEC13                      FLASH_SECBB2R2_SEC13_Msk                      /*!< Page 45 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC14_Pos                  (14U)
#define FLASH_SECBB2R2_SEC14_Msk                  (0x1UL << FLASH_SECBB2R2_SEC14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R2_SEC14                      FLASH_SECBB2R2_SEC14_Msk                      /*!< Page 46 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC15_Pos                  (15U)
#define FLASH_SECBB2R2_SEC15_Msk                  (0x1UL << FLASH_SECBB2R2_SEC15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R2_SEC15                      FLASH_SECBB2R2_SEC15_Msk                      /*!< Page 47 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC16_Pos                  (16U)
#define FLASH_SECBB2R2_SEC16_Msk                  (0x1UL << FLASH_SECBB2R2_SEC16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R2_SEC16                      FLASH_SECBB2R2_SEC16_Msk                      /*!< Page 48 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC17_Pos                  (17U)
#define FLASH_SECBB2R2_SEC17_Msk                  (0x1UL << FLASH_SECBB2R2_SEC17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R2_SEC17                      FLASH_SECBB2R2_SEC17_Msk                      /*!< Page 49 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC18_Pos                  (18U)
#define FLASH_SECBB2R2_SEC18_Msk                  (0x1UL << FLASH_SECBB2R2_SEC18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R2_SEC18                      FLASH_SECBB2R2_SEC18_Msk                      /*!< Page 50 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC19_Pos                  (19U)
#define FLASH_SECBB2R2_SEC19_Msk                  (0x1UL << FLASH_SECBB2R2_SEC19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R2_SEC19                      FLASH_SECBB2R2_SEC19_Msk                      /*!< Page 51 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC20_Pos                  (20U)
#define FLASH_SECBB2R2_SEC20_Msk                  (0x1UL << FLASH_SECBB2R2_SEC20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R2_SEC20                      FLASH_SECBB2R2_SEC20_Msk                      /*!< Page 52 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC21_Pos                  (21U)
#define FLASH_SECBB2R2_SEC21_Msk                  (0x1UL << FLASH_SECBB2R2_SEC21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R2_SEC21                      FLASH_SECBB2R2_SEC21_Msk                      /*!< Page 53 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC22_Pos                  (22U)
#define FLASH_SECBB2R2_SEC22_Msk                  (0x1UL << FLASH_SECBB2R2_SEC22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R2_SEC22                      FLASH_SECBB2R2_SEC22_Msk                      /*!< Page 54 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC23_Pos                  (23U)
#define FLASH_SECBB2R2_SEC23_Msk                  (0x1UL << FLASH_SECBB2R2_SEC23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R2_SEC23                      FLASH_SECBB2R2_SEC23_Msk                      /*!< Page 55 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC24_Pos                  (24U)
#define FLASH_SECBB2R2_SEC24_Msk                  (0x1UL << FLASH_SECBB2R2_SEC24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R2_SEC24                      FLASH_SECBB2R2_SEC24_Msk                      /*!< Page 56 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC25_Pos                  (25U)
#define FLASH_SECBB2R2_SEC25_Msk                  (0x1UL << FLASH_SECBB2R2_SEC25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R2_SEC25                      FLASH_SECBB2R2_SEC25_Msk                      /*!< Page 57 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC26_Pos                  (26U)
#define FLASH_SECBB2R2_SEC26_Msk                  (0x1UL << FLASH_SECBB2R2_SEC26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R2_SEC26                      FLASH_SECBB2R2_SEC26_Msk                      /*!< Page 58 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC27_Pos                  (27U)
#define FLASH_SECBB2R2_SEC27_Msk                  (0x1UL << FLASH_SECBB2R2_SEC27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R2_SEC27                      FLASH_SECBB2R2_SEC27_Msk                      /*!< Page 59 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC28_Pos                  (28U)
#define FLASH_SECBB2R2_SEC28_Msk                  (0x1UL << FLASH_SECBB2R2_SEC28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R2_SEC28                      FLASH_SECBB2R2_SEC28_Msk                      /*!< Page 60 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC29_Pos                  (29U)
#define FLASH_SECBB2R2_SEC29_Msk                  (0x1UL << FLASH_SECBB2R2_SEC29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R2_SEC29                      FLASH_SECBB2R2_SEC29_Msk                      /*!< Page 61 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC30_Pos                  (30U)
#define FLASH_SECBB2R2_SEC30_Msk                  (0x1UL << FLASH_SECBB2R2_SEC30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R2_SEC30                      FLASH_SECBB2R2_SEC30_Msk                      /*!< Page 62 in bank 2 block-based secure */
#define FLASH_SECBB2R2_SEC31_Pos                  (31U)
#define FLASH_SECBB2R2_SEC31_Msk                  (0x1UL << FLASH_SECBB2R2_SEC31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R2_SEC31                      FLASH_SECBB2R2_SEC31_Msk                      /*!< Page 63 in bank 2 block-based secure */

/*******************  Bit definition for FLASH_SECBB2R3 register  ******************/
#define FLASH_SECBB2R3_SEC0_Pos                   (0U)
#define FLASH_SECBB2R3_SEC0_Msk                   (0x1UL << FLASH_SECBB2R3_SEC0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R3_SEC0                       FLASH_SECBB2R3_SEC0_Msk                       /*!< Page 64 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC1_Pos                   (1U)
#define FLASH_SECBB2R3_SEC1_Msk                   (0x1UL << FLASH_SECBB2R3_SEC1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R3_SEC1                       FLASH_SECBB2R3_SEC1_Msk                       /*!< Page 65 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC2_Pos                   (2U)
#define FLASH_SECBB2R3_SEC2_Msk                   (0x1UL << FLASH_SECBB2R3_SEC2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R3_SEC2                       FLASH_SECBB2R3_SEC2_Msk                       /*!< Page 66 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC3_Pos                   (3U)
#define FLASH_SECBB2R3_SEC3_Msk                   (0x1UL << FLASH_SECBB2R3_SEC3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R3_SEC3                       FLASH_SECBB2R3_SEC3_Msk                       /*!< Page 67 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC4_Pos                   (4U)
#define FLASH_SECBB2R3_SEC4_Msk                   (0x1UL << FLASH_SECBB2R3_SEC4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R3_SEC4                       FLASH_SECBB2R3_SEC4_Msk                       /*!< Page 68 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC5_Pos                   (5U)
#define FLASH_SECBB2R3_SEC5_Msk                   (0x1UL << FLASH_SECBB2R3_SEC5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R3_SEC5                       FLASH_SECBB2R3_SEC5_Msk                       /*!< Page 69 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC6_Pos                   (6U)
#define FLASH_SECBB2R3_SEC6_Msk                   (0x1UL << FLASH_SECBB2R3_SEC6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R3_SEC6                       FLASH_SECBB2R3_SEC6_Msk                       /*!< Page 70 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC7_Pos                   (7U)
#define FLASH_SECBB2R3_SEC7_Msk                   (0x1UL << FLASH_SECBB2R3_SEC7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R3_SEC7                       FLASH_SECBB2R3_SEC7_Msk                       /*!< Page 71 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC8_Pos                   (8U)
#define FLASH_SECBB2R3_SEC8_Msk                   (0x1UL << FLASH_SECBB2R3_SEC8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R3_SEC8                       FLASH_SECBB2R3_SEC8_Msk                       /*!< Page 72 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC9_Pos                   (9U)
#define FLASH_SECBB2R3_SEC9_Msk                   (0x1UL << FLASH_SECBB2R3_SEC9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R3_SEC9                       FLASH_SECBB2R3_SEC9_Msk                       /*!< Page 73 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC10_Pos                  (10U)
#define FLASH_SECBB2R3_SEC10_Msk                  (0x1UL << FLASH_SECBB2R3_SEC10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R3_SEC10                      FLASH_SECBB2R3_SEC10_Msk                      /*!< Page 74 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC11_Pos                  (11U)
#define FLASH_SECBB2R3_SEC11_Msk                  (0x1UL << FLASH_SECBB2R3_SEC11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R3_SEC11                      FLASH_SECBB2R3_SEC11_Msk                      /*!< Page 75 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC12_Pos                  (12U)
#define FLASH_SECBB2R3_SEC12_Msk                  (0x1UL << FLASH_SECBB2R3_SEC12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R3_SEC12                      FLASH_SECBB2R3_SEC12_Msk                      /*!< Page 76 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC13_Pos                  (13U)
#define FLASH_SECBB2R3_SEC13_Msk                  (0x1UL << FLASH_SECBB2R3_SEC13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R3_SEC13                      FLASH_SECBB2R3_SEC13_Msk                      /*!< Page 77 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC14_Pos                  (14U)
#define FLASH_SECBB2R3_SEC14_Msk                  (0x1UL << FLASH_SECBB2R3_SEC14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R3_SEC14                      FLASH_SECBB2R3_SEC14_Msk                      /*!< Page 78 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC15_Pos                  (15U)
#define FLASH_SECBB2R3_SEC15_Msk                  (0x1UL << FLASH_SECBB2R3_SEC15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R3_SEC15                      FLASH_SECBB2R3_SEC15_Msk                      /*!< Page 79 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC16_Pos                  (16U)
#define FLASH_SECBB2R3_SEC16_Msk                  (0x1UL << FLASH_SECBB2R3_SEC16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R3_SEC16                      FLASH_SECBB2R3_SEC16_Msk                      /*!< Page 80 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC17_Pos                  (17U)
#define FLASH_SECBB2R3_SEC17_Msk                  (0x1UL << FLASH_SECBB2R3_SEC17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R3_SEC17                      FLASH_SECBB2R3_SEC17_Msk                      /*!< Page 81 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC18_Pos                  (18U)
#define FLASH_SECBB2R3_SEC18_Msk                  (0x1UL << FLASH_SECBB2R3_SEC18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R3_SEC18                      FLASH_SECBB2R3_SEC18_Msk                      /*!< Page 82 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC19_Pos                  (19U)
#define FLASH_SECBB2R3_SEC19_Msk                  (0x1UL << FLASH_SECBB2R3_SEC19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R3_SEC19                      FLASH_SECBB2R3_SEC19_Msk                      /*!< Page 83 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC20_Pos                  (20U)
#define FLASH_SECBB2R3_SEC20_Msk                  (0x1UL << FLASH_SECBB2R3_SEC20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R3_SEC20                      FLASH_SECBB2R3_SEC20_Msk                      /*!< Page 84 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC21_Pos                  (21U)
#define FLASH_SECBB2R3_SEC21_Msk                  (0x1UL << FLASH_SECBB2R3_SEC21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R3_SEC21                      FLASH_SECBB2R3_SEC21_Msk                      /*!< Page 85 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC22_Pos                  (22U)
#define FLASH_SECBB2R3_SEC22_Msk                  (0x1UL << FLASH_SECBB2R3_SEC22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R3_SEC22                      FLASH_SECBB2R3_SEC22_Msk                      /*!< Page 86 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC23_Pos                  (23U)
#define FLASH_SECBB2R3_SEC23_Msk                  (0x1UL << FLASH_SECBB2R3_SEC23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R3_SEC23                      FLASH_SECBB2R3_SEC23_Msk                      /*!< Page 87 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC24_Pos                  (24U)
#define FLASH_SECBB2R3_SEC24_Msk                  (0x1UL << FLASH_SECBB2R3_SEC24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R3_SEC24                      FLASH_SECBB2R3_SEC24_Msk                      /*!< Page 88 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC25_Pos                  (25U)
#define FLASH_SECBB2R3_SEC25_Msk                  (0x1UL << FLASH_SECBB2R3_SEC25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R3_SEC25                      FLASH_SECBB2R3_SEC25_Msk                      /*!< Page 89 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC26_Pos                  (26U)
#define FLASH_SECBB2R3_SEC26_Msk                  (0x1UL << FLASH_SECBB2R3_SEC26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R3_SEC26                      FLASH_SECBB2R3_SEC26_Msk                      /*!< Page 90 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC27_Pos                  (27U)
#define FLASH_SECBB2R3_SEC27_Msk                  (0x1UL << FLASH_SECBB2R3_SEC27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R3_SEC27                      FLASH_SECBB2R3_SEC27_Msk                      /*!< Page 91 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC28_Pos                  (28U)
#define FLASH_SECBB2R3_SEC28_Msk                  (0x1UL << FLASH_SECBB2R3_SEC28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R3_SEC28                      FLASH_SECBB2R3_SEC28_Msk                      /*!< Page 92 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC29_Pos                  (29U)
#define FLASH_SECBB2R3_SEC29_Msk                  (0x1UL << FLASH_SECBB2R3_SEC29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R3_SEC29                      FLASH_SECBB2R3_SEC29_Msk                      /*!< Page 93 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC30_Pos                  (30U)
#define FLASH_SECBB2R3_SEC30_Msk                  (0x1UL << FLASH_SECBB2R3_SEC30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R3_SEC30                      FLASH_SECBB2R3_SEC30_Msk                      /*!< Page 94 in bank 2 block-based secure */
#define FLASH_SECBB2R3_SEC31_Pos                  (31U)
#define FLASH_SECBB2R3_SEC31_Msk                  (0x1UL << FLASH_SECBB2R3_SEC31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R3_SEC31                      FLASH_SECBB2R3_SEC31_Msk                      /*!< Page 95 in bank 2 block-based secure */

