stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u356xx.h
/********************  Bit definition for PWR_PDCRH register  *****************/
#define PWR_PDCRH_PD0_Pos                   (0U)
#define PWR_PDCRH_PD0_Msk                   (0x1UL << PWR_PDCRH_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRH_PD0                       PWR_PDCRH_PD0_Msk                       /*!< Apply pull-down for PH0  */
#define PWR_PDCRH_PD1_Pos                   (1U)
#define PWR_PDCRH_PD1_Msk                   (0x1UL << PWR_PDCRH_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRH_PD1                       PWR_PDCRH_PD1_Msk                       /*!< Apply pull-down for PH1  */
#define PWR_PDCRH_PD3_Pos                   (3U)
#define PWR_PDCRH_PD3_Msk                   (0x1UL << PWR_PDCRH_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRH_PD3                       PWR_PDCRH_PD3_Msk                       /*!< Apply pull-down for PH3  */

/********************  Bit definition for PWR_I3CPUCR1 register  *****************/
#define PWR_I3CPUCR1_PA1_I3CPU_Pos          (0U)
#define PWR_I3CPUCR1_PA1_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PA1_I3CPU_Pos)   /*!< 0x00000001 */
#define PWR_I3CPUCR1_PA1_I3CPU              PWR_I3CPUCR1_PA1_I3CPU_Msk              /*!< Port A pin 1 I3C pull-up  */
#define PWR_I3CPUCR1_PA6_I3CPU_Pos          (1U)
#define PWR_I3CPUCR1_PA6_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PA6_I3CPU_Pos)   /*!< 0x00000002 */
#define PWR_I3CPUCR1_PA6_I3CPU              PWR_I3CPUCR1_PA6_I3CPU_Msk              /*!< Port A pin 6 I3C pull-up  */
#define PWR_I3CPUCR1_PA7_I3CPU_Pos          (2U)
#define PWR_I3CPUCR1_PA7_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PA7_I3CPU_Pos)   /*!< 0x00000004 */
#define PWR_I3CPUCR1_PA7_I3CPU              PWR_I3CPUCR1_PA7_I3CPU_Msk              /*!< Port A pin 7 I3C pull-up  */
#define PWR_I3CPUCR1_PB2_I3CPU_Pos          (4U)
#define PWR_I3CPUCR1_PB2_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB2_I3CPU_Pos)   /*!< 0x00000010 */
#define PWR_I3CPUCR1_PB2_I3CPU              PWR_I3CPUCR1_PB2_I3CPU_Msk              /*!< Port B pin 2 I3C pull-up  */
#define PWR_I3CPUCR1_PB6_I3CPU_Pos          (5U)
#define PWR_I3CPUCR1_PB6_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB6_I3CPU_Pos)   /*!< 0x00000020 */
#define PWR_I3CPUCR1_PB6_I3CPU              PWR_I3CPUCR1_PB6_I3CPU_Msk              /*!< Port B pin 6 I3C pull-up  */
#define PWR_I3CPUCR1_PB8_I3CPU_Pos          (6U)
#define PWR_I3CPUCR1_PB8_I3CPU_Msk          (0x1UL << PWR_I3CPUCR1_PB8_I3CPU_Pos)   /*!< 0x00000040 */
#define PWR_I3CPUCR1_PB8_I3CPU              PWR_I3CPUCR1_PB8_I3CPU_Msk              /*!< Port B pin 8 I3C pull-up  */
#define PWR_I3CPUCR1_PB12_I3CPU_Pos         (9U)
#define PWR_I3CPUCR1_PB12_I3CPU_Msk         (0x1UL << PWR_I3CPUCR1_PB12_I3CPU_Pos)  /*!< 0x00000200 */
#define PWR_I3CPUCR1_PB12_I3CPU             PWR_I3CPUCR1_PB12_I3CPU_Msk             /*!< Port B pin 12 I3C pull-up */
#define PWR_I3CPUCR1_PB13_I3CPU_Pos         (10U)
#define PWR_I3CPUCR1_PB13_I3CPU_Msk         (0x1UL << PWR_I3CPUCR1_PB13_I3CPU_Pos)  /*!< 0x00000400 */
#define PWR_I3CPUCR1_PB13_I3CPU             PWR_I3CPUCR1_PB13_I3CPU_Msk             /*!< Port B pin 13 I3C pull-up */

/********************  Bit definition for PWR_I3CPUCR2 register  *****************/
#define PWR_I3CPUCR2_PC1_I3CPU_Pos          (1U)
#define PWR_I3CPUCR2_PC1_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PC1_I3CPU_Pos)   /*!< 0x00000002 */
#define PWR_I3CPUCR2_PC1_I3CPU              PWR_I3CPUCR2_PC1_I3CPU_Msk              /*!< Port C pin 1 I3C pull-up  */
#define PWR_I3CPUCR2_PD12_I3CPU_Pos         (3U)
#define PWR_I3CPUCR2_PD12_I3CPU_Msk         (0x1UL << PWR_I3CPUCR2_PD12_I3CPU_Pos)  /*!< 0x00000008 */
#define PWR_I3CPUCR2_PD12_I3CPU             PWR_I3CPUCR2_PD12_I3CPU_Msk             /*!< Port D pin 12 I3C pull-up */
#define PWR_I3CPUCR2_PD13_I3CPU_Pos         (4U)
#define PWR_I3CPUCR2_PD13_I3CPU_Msk         (0x1UL << PWR_I3CPUCR2_PD13_I3CPU_Pos)  /*!< 0x00000010 */
#define PWR_I3CPUCR2_PD13_I3CPU             PWR_I3CPUCR2_PD13_I3CPU_Msk             /*!< Port D pin 13 I3C pull-up */
#define PWR_I3CPUCR2_PH3_I3CPU_Pos          (11U)
#define PWR_I3CPUCR2_PH3_I3CPU_Msk          (0x1UL << PWR_I3CPUCR2_PH3_I3CPU_Pos)   /*!< 0x00000800 */
#define PWR_I3CPUCR2_PH3_I3CPU              PWR_I3CPUCR2_PH3_I3CPU_Msk              /*!< Port H pin 3 I3C pull-up  */

/******************************************************************************/
/*                                                                            */
/*                      SRAMs configuration controller                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for RAMCFG_MxCR register  ******************/
#define RAMCFG_CR_PCE_Pos                   (0U)
#define RAMCFG_CR_PCE_Msk                   (0x1UL << RAMCFG_CR_PCE_Pos)              /*!< 0x00000001 */
#define RAMCFG_CR_PCE                       RAMCFG_CR_PCE_Msk                         /*!< Parity check Enable */
#define RAMCFG_CR_ALE_Pos                   (4U)
#define RAMCFG_CR_ALE_Msk                   (0x1UL << RAMCFG_CR_ALE_Pos)              /*!< 0x00000010 */
#define RAMCFG_CR_ALE                       RAMCFG_CR_ALE_Msk                         /*!< Address Latching Enable */
#define RAMCFG_CR_SRAMER_Pos                (8U)
#define RAMCFG_CR_SRAMER_Msk                (0x1UL << RAMCFG_CR_SRAMER_Pos)           /*!< 0x00000100 */
#define RAMCFG_CR_SRAMER                    RAMCFG_CR_SRAMER_Msk                      /*!< Start Erase */

/*******************  Bit definition for RAMCFG_MxIER register  ******************/
#define RAMCFG_IER_PEIE_Pos                 (1U)
#define RAMCFG_IER_PEIE_Msk                 (0x1UL << RAMCFG_IER_PEIE_Pos)            /*!< 0x00000001 */
#define RAMCFG_IER_PEIE                     RAMCFG_IER_PEIE_Msk                       /*!< Parity error interrupt enable */
#define RAMCFG_IER_PENMI_Pos                (3U)
#define RAMCFG_IER_PENMI_Msk                (0x1UL << RAMCFG_IER_PENMI_Pos)           /*!< 0x00000004 */
#define RAMCFG_IER_PENMI                    RAMCFG_IER_PENMI_Msk                      /*!< Parity error NMI */

