stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u356xx.h
/********************  Bit definition for RCC_CFGR2 register  ******************/
#define RCC_CFGR2_HPRE_Pos                  (0U)
#define RCC_CFGR2_HPRE_Msk                  (0xFUL << RCC_CFGR2_HPRE_Pos)           /*!< 0x0000000F */
#define RCC_CFGR2_HPRE                      RCC_CFGR2_HPRE_Msk                      /*!< HPRE[3:0] bits : AHB prescaler */
#define RCC_CFGR2_HPRE_0                    (0x1UL << RCC_CFGR2_HPRE_Pos)           /*!< 0x00000001 */
#define RCC_CFGR2_HPRE_1                    (0x2UL << RCC_CFGR2_HPRE_Pos)           /*!< 0x00000002 */
#define RCC_CFGR2_HPRE_2                    (0x4UL << RCC_CFGR2_HPRE_Pos)           /*!< 0x00000004 */
#define RCC_CFGR2_HPRE_3                    (0x8UL << RCC_CFGR2_HPRE_Pos)           /*!< 0x00000008 */
#define RCC_CFGR2_PPRE1_Pos                 (4U)
#define RCC_CFGR2_PPRE1_Msk                 (0x7UL << RCC_CFGR2_PPRE1_Pos)          /*!< 0x00000070 */
#define RCC_CFGR2_PPRE1                     RCC_CFGR2_PPRE1_Msk                     /*!< PPRE1[2:0] bits : APB1 prescaler */
#define RCC_CFGR2_PPRE1_0                   (0x1UL << RCC_CFGR2_PPRE1_Pos)          /*!< 0x00000010 */
#define RCC_CFGR2_PPRE1_1                   (0x2UL << RCC_CFGR2_PPRE1_Pos)          /*!< 0x00000020 */
#define RCC_CFGR2_PPRE1_2                   (0x4UL << RCC_CFGR2_PPRE1_Pos)          /*!< 0x00000040 */
#define RCC_CFGR2_PPRE2_Pos                 (8U)
#define RCC_CFGR2_PPRE2_Msk                 (0x7UL << RCC_CFGR2_PPRE2_Pos)          /*!< 0x00000700 */
#define RCC_CFGR2_PPRE2                     RCC_CFGR2_PPRE2_Msk                     /*!< PPRE2[2:0] bits : APB2 prescaler */
#define RCC_CFGR2_PPRE2_0                   (0x1UL << RCC_CFGR2_PPRE2_Pos)          /*!< 0x00000100 */
#define RCC_CFGR2_PPRE2_1                   (0x2UL << RCC_CFGR2_PPRE2_Pos)          /*!< 0x00000200 */
#define RCC_CFGR2_PPRE2_2                   (0x4UL << RCC_CFGR2_PPRE2_Pos)          /*!< 0x00000400 */

/********************  Bit definition for RCC_CFGR3 register  ******************/
#define RCC_CFGR3_PPRE3_Pos                 (4U)
#define RCC_CFGR3_PPRE3_Msk                 (0x7UL << RCC_CFGR3_PPRE3_Pos)          /*!< 0x00000070 */
#define RCC_CFGR3_PPRE3                     RCC_CFGR3_PPRE3_Msk                     /*!< PPRE3[2:0] bits : APB3 prescaler */
#define RCC_CFGR3_PPRE3_0                   (0x1UL << RCC_CFGR3_PPRE3_Pos)          /*!< 0x00000010 */
#define RCC_CFGR3_PPRE3_1                   (0x2UL << RCC_CFGR3_PPRE3_Pos)          /*!< 0x00000020 */
#define RCC_CFGR3_PPRE3_2                   (0x4UL << RCC_CFGR3_PPRE3_Pos)          /*!< 0x00000040 */

/********************  Bit definition for RCC_CFGR4 register  ******************/
#define RCC_CFGR4_BOOSTSEL_Pos              (0U)
#define RCC_CFGR4_BOOSTSEL_Msk              (0x3UL << RCC_CFGR4_BOOSTSEL_Pos)       /*!< 0x00000003 */
#define RCC_CFGR4_BOOSTSEL                  RCC_CFGR4_BOOSTSEL_Msk                  /*!< BOOSTSEL[1:0] bits : EPOD booster input clock source selection */
#define RCC_CFGR4_BOOSTSEL_0                (0x1UL << RCC_CFGR4_BOOSTSEL_Pos)       /*!< 0x00000001 */
#define RCC_CFGR4_BOOSTSEL_1                (0x2UL << RCC_CFGR4_BOOSTSEL_Pos)       /*!< 0x00000002 */
#define RCC_CFGR4_BOOSTDIV_Pos              (12U)
#define RCC_CFGR4_BOOSTDIV_Msk              (0xFUL << RCC_CFGR4_BOOSTDIV_Pos)       /*!< 0x0000F000 */
#define RCC_CFGR4_BOOSTDIV                  RCC_CFGR4_BOOSTDIV_Msk                  /*!< BOOSTDIV[3:0] bits : EPOD booster input clock prescaler */
#define RCC_CFGR4_BOOSTDIV_0                (0x1UL << RCC_CFGR4_BOOSTDIV_Pos)       /*!< 0x00001000 */
#define RCC_CFGR4_BOOSTDIV_1                (0x2UL << RCC_CFGR4_BOOSTDIV_Pos)       /*!< 0x00002000 */
#define RCC_CFGR4_BOOSTDIV_2                (0x4UL << RCC_CFGR4_BOOSTDIV_Pos)       /*!< 0x00004000 */
#define RCC_CFGR4_BOOSTDIV_3                (0x8UL << RCC_CFGR4_BOOSTDIV_Pos)       /*!< 0x00008000 */

/********************  Bit definition for RCC_CIER register  ******************/
#define RCC_CIER_LSIRDYIE_Pos               (0U)
#define RCC_CIER_LSIRDYIE_Msk               (0x1UL << RCC_CIER_LSIRDYIE_Pos)        /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE                   RCC_CIER_LSIRDYIE_Msk                   /*!< LSI Ready Interrupt Enable */
#define RCC_CIER_LSERDYIE_Pos               (1U)
#define RCC_CIER_LSERDYIE_Msk               (0x1UL << RCC_CIER_LSERDYIE_Pos)        /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE                   RCC_CIER_LSERDYIE_Msk                   /*!< LSE Ready Interrupt Enable */
#define RCC_CIER_MSISRDYIE_Pos              (2U)
#define RCC_CIER_MSISRDYIE_Msk              (0x1UL << RCC_CIER_MSISRDYIE_Pos)       /*!< 0x00000004 */
#define RCC_CIER_MSISRDYIE                  RCC_CIER_MSISRDYIE_Msk                  /*!< MSIS Ready Interrupt Enable */
#define RCC_CIER_HSIRDYIE_Pos               (3U)
#define RCC_CIER_HSIRDYIE_Msk               (0x1UL << RCC_CIER_HSIRDYIE_Pos)        /*!< 0x00000008 */
#define RCC_CIER_HSIRDYIE                   RCC_CIER_HSIRDYIE_Msk                   /*!< HSI16 Ready Interrupt Enable */
#define RCC_CIER_HSERDYIE_Pos               (4U)
#define RCC_CIER_HSERDYIE_Msk               (0x1UL << RCC_CIER_HSERDYIE_Pos)        /*!< 0x00000010 */
#define RCC_CIER_HSERDYIE                   RCC_CIER_HSERDYIE_Msk                   /*!< HSE Ready Interrupt Enable */
#define RCC_CIER_HSI48RDYIE_Pos             (5U)
#define RCC_CIER_HSI48RDYIE_Msk             (0x1UL << RCC_CIER_HSI48RDYIE_Pos)      /*!< 0x00000020 */
#define RCC_CIER_HSI48RDYIE                 RCC_CIER_HSI48RDYIE_Msk                 /*!< HSI48 Ready Interrupt Enable */
#define RCC_CIER_MSIPLL1RDYIE_Pos           (6U)
#define RCC_CIER_MSIPLL1RDYIE_Msk           (0x1UL << RCC_CIER_MSIPLL1RDYIE_Pos)    /*!< 0x00000040 */
#define RCC_CIER_MSIPLL1RDYIE               RCC_CIER_MSIPLL1RDYIE_Msk               /*!< MSIRC1 PLL-mode Ready Interrupt Enable */
#define RCC_CIER_MSIPLL0RDYIE_Pos           (7U)
#define RCC_CIER_MSIPLL0RDYIE_Msk           (0x1UL << RCC_CIER_MSIPLL0RDYIE_Pos)    /*!< 0x00000080 */
#define RCC_CIER_MSIPLL0RDYIE               RCC_CIER_MSIPLL0RDYIE_Msk               /*!< MSIRC0 PLL-mode Ready Interrupt Enable */
#define RCC_CIER_MSIPLLUIE_Pos              (8U)
#define RCC_CIER_MSIPLLUIE_Msk              (0x1UL << RCC_CIER_MSIPLLUIE_Pos)       /*!< 0x00000100 */
#define RCC_CIER_MSIPLLUIE                  RCC_CIER_MSIPLLUIE_Msk                  /*!< MSI PLL-mode with LSE unlock Interrupt Enable*/
#define RCC_CIER_MSIPLLHSUIE_Pos            (9U)
#define RCC_CIER_MSIPLLHSUIE_Msk            (0x1UL << RCC_CIER_MSIPLLHSUIE_Pos)     /*!< 0x00000200 */
#define RCC_CIER_MSIPLLHSUIE                RCC_CIER_MSIPLLHSUIE_Msk                /*!< MSI PLL-mode with HSE unlock Interrupt Enable */
#define RCC_CIER_MSIKRDYIE_Pos              (11U)
#define RCC_CIER_MSIKRDYIE_Msk              (0x1UL << RCC_CIER_MSIKRDYIE_Pos)       /*!< 0x00000800 */
#define RCC_CIER_MSIKRDYIE                  RCC_CIER_MSIKRDYIE_Msk                  /*!< MSIK Ready Interrupt Enable */
#define RCC_CIER_LSECSSIE_Pos               (12U)
#define RCC_CIER_LSECSSIE_Msk               (0x1UL << RCC_CIER_LSECSSIE_Pos)        /*!< 0x00001000 */
#define RCC_CIER_LSECSSIE                   RCC_CIER_LSECSSIE_Msk                   /*!< LSE Clock Security System Interrupt Enable */

/********************  Bit definition for RCC_CIFR register  ******************/
#define RCC_CIFR_LSIRDYF_Pos                (0U)
#define RCC_CIFR_LSIRDYF_Msk                (0x1UL << RCC_CIFR_LSIRDYF_Pos)        /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF                    RCC_CIFR_LSIRDYF_Msk                   /*!< LSI Ready Interrupt Flag*/
#define RCC_CIFR_LSERDYF_Pos                (1U)
#define RCC_CIFR_LSERDYF_Msk                (0x1UL << RCC_CIFR_LSERDYF_Pos)        /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF                    RCC_CIFR_LSERDYF_Msk                   /*!< LSF Ready Interrupt Flag*/
#define RCC_CIFR_MSISRDYF_Pos               (2U)
#define RCC_CIFR_MSISRDYF_Msk               (0x1UL << RCC_CIFR_MSISRDYF_Pos)       /*!< 0x00000004 */
#define RCC_CIFR_MSISRDYF                   RCC_CIFR_MSISRDYF_Msk                  /*!< MSIS Ready Interrupt Flag*/
#define RCC_CIFR_HSIRDYF_Pos                (3U)
#define RCC_CIFR_HSIRDYF_Msk                (0x1UL << RCC_CIFR_HSIRDYF_Pos)        /*!< 0x00000008 */
#define RCC_CIFR_HSIRDYF                    RCC_CIFR_HSIRDYF_Msk                   /*!< HSI16 Ready Interrupt Flag*/
#define RCC_CIFR_HSERDYF_Pos                (4U)
#define RCC_CIFR_HSERDYF_Msk                (0x1UL << RCC_CIFR_HSERDYF_Pos)        /*!< 0x00000010 */
#define RCC_CIFR_HSERDYF                    RCC_CIFR_HSERDYF_Msk                   /*!< HSF Ready Interrupt Flag*/
#define RCC_CIFR_HSI48RDYF_Pos              (5U)
#define RCC_CIFR_HSI48RDYF_Msk              (0x1UL << RCC_CIFR_HSI48RDYF_Pos)      /*!< 0x00000020 */
#define RCC_CIFR_HSI48RDYF                  RCC_CIFR_HSI48RDYF_Msk                 /*!< HSI48 Ready Interrupt Flag*/
#define RCC_CIFR_MSIPLL1RDYF_Pos            (6U)
#define RCC_CIFR_MSIPLL1RDYF_Msk            (0x1UL << RCC_CIFR_MSIPLL1RDYF_Pos)    /*!< 0x00000040 */
#define RCC_CIFR_MSIPLL1RDYF                RCC_CIFR_MSIPLL1RDYF_Msk               /*!< MSIRC1 PLL-mode Ready Interrupt Flag*/
#define RCC_CIFR_MSIPLL0RDYF_Pos            (7U)
#define RCC_CIFR_MSIPLL0RDYF_Msk            (0x1UL << RCC_CIFR_MSIPLL0RDYF_Pos)    /*!< 0x00000080 */
#define RCC_CIFR_MSIPLL0RDYF                RCC_CIFR_MSIPLL0RDYF_Msk               /*!< MSIRC0 PLL-mode Ready Interrupt Flag*/
#define RCC_CIFR_MSIPLLUF_Pos               (8U)
#define RCC_CIFR_MSIPLLUF_Msk               (0x1UL << RCC_CIFR_MSIPLLUF_Pos)       /*!< 0x00000100 */
#define RCC_CIFR_MSIPLLUF                   RCC_CIFR_MSIPLLUF_Msk                  /*!< MSI PLL-mode with HSE unlock Interrupt Flag*/
#define RCC_CIFR_MSIPLLHSUF_Pos             (9U)
#define RCC_CIFR_MSIPLLHSUF_Msk             (0x1UL << RCC_CIFR_MSIPLLHSUF_Pos)     /*!< 0x00000200 */
#define RCC_CIFR_MSIPLLHSUF                 RCC_CIFR_MSIPLLHSUF_Msk                /*!< MSI PLL-mode with LSE unlock Interrupt Flag*/
#define RCC_CIFR_CSSF_Pos                   (10U)
#define RCC_CIFR_CSSF_Msk                   (0x1UL << RCC_CIFR_CSSF_Pos)           /*!< 0x00000400 */
#define RCC_CIFR_CSSF                       RCC_CIFR_CSSF_Msk                      /*!< HSE Clock Security System Interrupt flag */
#define RCC_CIFR_MSIKRDYF_Pos               (11U)
#define RCC_CIFR_MSIKRDYF_Msk               (0x1UL << RCC_CIFR_MSIKRDYF_Pos)       /*!< 0x00000800 */
#define RCC_CIFR_MSIKRDYF                   RCC_CIFR_MSIKRDYF_Msk                  /*!< MSIK Ready Interrupt Flag*/
#define RCC_CIFR_LSECSSF_Pos                (12U)
#define RCC_CIFR_LSECSSF_Msk                (0x1UL << RCC_CIFR_LSECSSF_Pos)        /*!< 0x00001000 */
#define RCC_CIFR_LSECSSF                    RCC_CIFR_LSECSSF_Msk                   /*!< LSF Clock Security System Interrupt Flag*/

/********************  Bit definition for RCC_CICR register  ******************/
#define RCC_CICR_LSIRDYC_Pos                (0U)
#define RCC_CICR_LSIRDYC_Msk                (0x1UL << RCC_CICR_LSIRDYC_Pos)        /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC                    RCC_CICR_LSIRDYC_Msk                   /*!< LSI Ready Interrupt Clear*/
#define RCC_CICR_LSERDYC_Pos                (1U)
#define RCC_CICR_LSERDYC_Msk                (0x1UL << RCC_CICR_LSERDYC_Pos)        /*!< 0x00000002 */
#define RCC_CICR_LSERDYC                    RCC_CICR_LSERDYC_Msk                   /*!< LSC Ready Interrupt Clear*/
#define RCC_CICR_MSISRDYC_Pos               (2U)
#define RCC_CICR_MSISRDYC_Msk               (0x1UL << RCC_CICR_MSISRDYC_Pos)       /*!< 0x00000004 */
#define RCC_CICR_MSISRDYC                   RCC_CICR_MSISRDYC_Msk                  /*!< MSIS Ready Interrupt Clear*/
#define RCC_CICR_HSIRDYC_Pos                (3U)
#define RCC_CICR_HSIRDYC_Msk                (0x1UL << RCC_CICR_HSIRDYC_Pos)        /*!< 0x00000008 */
#define RCC_CICR_HSIRDYC                    RCC_CICR_HSIRDYC_Msk                   /*!< HSI16 Ready Interrupt Clear*/
#define RCC_CICR_HSERDYC_Pos                (4U)
#define RCC_CICR_HSERDYC_Msk                (0x1UL << RCC_CICR_HSERDYC_Pos)        /*!< 0x00000010 */
#define RCC_CICR_HSERDYC                    RCC_CICR_HSERDYC_Msk                   /*!< HSC Ready Interrupt Clear*/
#define RCC_CICR_HSI48RDYC_Pos              (5U)
#define RCC_CICR_HSI48RDYC_Msk              (0x1UL << RCC_CICR_HSI48RDYC_Pos)      /*!< 0x00000020 */
#define RCC_CICR_HSI48RDYC                  RCC_CICR_HSI48RDYC_Msk                 /*!< HSI48 Ready Interrupt Clear*/
#define RCC_CICR_MSIPLL1RDYC_Pos            (6U)
#define RCC_CICR_MSIPLL1RDYC_Msk            (0x1UL << RCC_CICR_MSIPLL1RDYC_Pos)    /*!< 0x00000040 */
#define RCC_CICR_MSIPLL1RDYC                RCC_CICR_MSIPLL1RDYC_Msk               /*!< MSIRC1 PLL-mode Ready Interrupt Clear*/
#define RCC_CICR_MSIPLL0RDYC_Pos            (7U)
#define RCC_CICR_MSIPLL0RDYC_Msk            (0x1UL << RCC_CICR_MSIPLL0RDYC_Pos)    /*!< 0x00000080 */
#define RCC_CICR_MSIPLL0RDYC                RCC_CICR_MSIPLL0RDYC_Msk               /*!< MSIRC0 PLL-mode Ready Interrupt Clear*/
#define RCC_CICR_MSIPLLUC_Pos               (8U)
#define RCC_CICR_MSIPLLUC_Msk               (0x1UL << RCC_CICR_MSIPLLUC_Pos)       /*!< 0x00000100 */
#define RCC_CICR_MSIPLLUC                   RCC_CICR_MSIPLLUC_Msk                  /*!< MSI PLL-mode with HSE unlock Interrupt Clear*/
#define RCC_CICR_MSIPLLHSUC_Pos             (9U)
#define RCC_CICR_MSIPLLHSUC_Msk             (0x1UL << RCC_CICR_MSIPLLHSUC_Pos)     /*!< 0x00000200 */
#define RCC_CICR_MSIPLLHSUC                 RCC_CICR_MSIPLLHSUC_Msk                /*!< MSI PLL-mode with LSE unlock Interrupt Clear*/
#define RCC_CICR_CSSC_Pos                   (10U)
#define RCC_CICR_CSSC_Msk                   (0x1UL << RCC_CICR_CSSC_Pos)           /*!< 0x00000400 */
#define RCC_CICR_CSSC                       RCC_CICR_CSSC_Msk                      /*!< HSE Clock Security System Interrupt flag */
#define RCC_CICR_MSIKRDYC_Pos               (11U)
#define RCC_CICR_MSIKRDYC_Msk               (0x1UL << RCC_CICR_MSIKRDYC_Pos)       /*!< 0x00000800 */
#define RCC_CICR_MSIKRDYC                   RCC_CICR_MSIKRDYC_Msk                  /*!< MSIK Ready Interrupt Clear*/
#define RCC_CICR_LSECSSC_Pos                (12U)
#define RCC_CICR_LSECSSC_Msk                (0x1UL << RCC_CICR_LSECSSC_Pos)        /*!< 0x00001000 */
#define RCC_CICR_LSECSSC                    RCC_CICR_LSECSSC_Msk                   /*!< LSE Clock Security System Interrupt Clear*/

/********************  Bit definition for RCC_AHB1RSTR1 register  **************/
#define RCC_AHB1RSTR1_GPDMA1RST_Pos         (0U)
#define RCC_AHB1RSTR1_GPDMA1RST_Msk         (0x1UL << RCC_AHB1RSTR1_GPDMA1RST_Pos)     /*!< 0x00000001 */
#define RCC_AHB1RSTR1_GPDMA1RST             RCC_AHB1RSTR1_GPDMA1RST_Msk                /*!< GPDMA1 Reset */
#define RCC_AHB1RSTR1_CRCRST_Pos            (12U)
#define RCC_AHB1RSTR1_CRCRST_Msk            (0x1UL << RCC_AHB1RSTR1_CRCRST_Pos)        /*!< 0x00001000 */
#define RCC_AHB1RSTR1_CRCRST                RCC_AHB1RSTR1_CRCRST_Msk                   /*!< CRC Reset */
#define RCC_AHB1RSTR1_TSCRST_Pos            (16U)
#define RCC_AHB1RSTR1_TSCRST_Msk            (0x1UL << RCC_AHB1RSTR1_TSCRST_Pos)        /*!< 0x00010000 */
#define RCC_AHB1RSTR1_TSCRST                RCC_AHB1RSTR1_TSCRST_Msk                   /*!< TSC Reset */
#define RCC_AHB1RSTR1_RAMCFGRST_Pos         (17U)
#define RCC_AHB1RSTR1_RAMCFGRST_Msk         (0x1UL << RCC_AHB1RSTR1_RAMCFGRST_Pos)     /*!< 0x00020000 */
#define RCC_AHB1RSTR1_RAMCFGRST             RCC_AHB1RSTR1_RAMCFGRST_Msk                /*!< RAMCFG Reset */

